chip_cooling_home/chip_cooling/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 96.259;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 96.259;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            epsilonWallFunction;
        value           uniform 96.259;
    }

    bottom
    {
        type            epsilonWallFunction;
        value           uniform 96.259;
    }

    side1
    {
        type            epsilonWallFunction;
        value           uniform 96.259;
    }
    side2
    {
        type            epsilonWallFunction;
        value           uniform 96.259;
    }
    solid
    {
        type            epsilonWallFunction;
        value           uniform 96.259;
    }
}


// ************************************************************************* //
