chip_cooling_home/chip_cooling/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "chip_cooling.fms";

minCellSize 0.25;

maxCellSize 4;

boundaryCellSize 0.5;

boundaryLayers
{
    nLayers 3;

    thicknessRatio 1.1;

    maxFirstLayerThickness 0.5;

//    patchBoundaryLayers
//    {
//    }
}

renameBoundary
{
    defaultName     fixedWalls;
    defaultType     wall;

    newPatchNames
    {
       "xMin" { newName side1 ; type wall ; inGroups 1(wall); } 
       "xMax" { newName side2 ; type wall ; inGroups 1(wall); } 
       "yMin" { newName inlet ; type patch ; } 
       "yMax" { newName outlet ; type patch ; } 
       "zMin" { newName bottom ; type wall ; inGroups 1(wall); } 
       "zMax" { newName top ; type wall ; inGroups 1(wall); } 
    }
}


// ************************************************************************* //
